deckbox_api/app/controllers/deckboxes_controller.rb

SELECT "deckboxes".* FROM "deckboxes"
---
  def index
    @deckboxes = Deckbox.all

SELECT "deckboxes".* FROM "deckboxes" WHERE "deckboxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_deckbox
      @deckbox = Deckbox.find(params[:id])